package com.skcc;

import java.util.ArrayList;
import java.util.List;

public class MainOrder {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		List<String> È¸ÀÇ½Ç¸®½ºÆ® = new ArrayList<>();
		È¸ÀÇ½Ç¸®½ºÆ®.add("101È£");
		È¸ÀÇ½Ç¸®½ºÆ®.add("102È£");
		È¸ÀÇ½Ç¸®½ºÆ®.add("103È£");
		È¸ÀÇ½Ç¸®½ºÆ®.add("104È£");
		
		String ¼Ò¿µ = null;
		int ¼Ò¿µÀÇ°É·¹±ú²ýÇÔ = 5;
		int ¼Ò¿µ¿Î½º = 10;
		¹Ù´ÚÃ»¼ÒÇÏ±â(È¸ÀÇ½Ç¸®½ºÆ®.get(0),¼Ò¿µ,¼Ò¿µ¿Î½º);
		if ( ¼Ò¿µ¿Î½º == 0 ) {
		¿Î½º¸®ÇÊ(¼Ò¿µ¿Î½º);
		}
		if ( ¼Ò¿µÀÇ°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}
		
		String À±°æ = null;
		int À±°æ¿Î½º = 3;
		int À±°æÀÇ°É·¹±ú²ýÇÔ = 5;
		¹Ù´ÚÃ»¼ÒÇÏ±â(È¸ÀÇ½Ç¸®½ºÆ®.get(1),À±°æ,À±°æ¿Î½º);
		if ( À±°æ¿Î½º == 0 ) {
		¿Î½º¸®ÇÊ(À±°æ¿Î½º);
		}
		if ( À±°æÀÇ°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}

		
		String ¼ÒÈñ = null;
		int ¼ÒÈñ¿Î½º = 5;
		int ¼ÒÈñÀÇ°É·¹±ú²ýÇÔ = 5;
		¹Ù´ÚÃ»¼ÒÇÏ±â(È¸ÀÇ½Ç¸®½ºÆ®.get(2),¼ÒÈñ,¼Ò¿µ¿Î½º);
	
		if ( ¼ÒÈñ¿Î½º == 0 ) {
		¿Î½º¸®ÇÊ(¼ÒÈñ¿Î½º);
		}
		if ( ¼ÒÈñÀÇ°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}	
		
		
		
		String ¼ÒÁø = null;
		int ¼ÒÁø¿Î½º = 5; 
		int ¼ÒÁøÀÇ°É·¹±ú²ýÇÔ = 5;
		¹Ù´ÚÃ»¼ÒÇÏ±â(È¸ÀÇ½Ç¸®½ºÆ®.get(3),¼ÒÁø,¼Ò¿µ¿Î½º);
		if ( ¼ÒÁø¿Î½º == 0 ) {
		¿Î½º¸®ÇÊ(¼ÒÁø¿Î½º);
		}
		if ( ¼ÒÁøÀÇ°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}	
		
		String ¿µÀº = null;
		int ¿µÀº°É·¹±ú²ýÇÔ = 5;
		int ¿µÀºÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ = 5;
		Ä¥ÆÇ´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(0),¿µÀº);
		Ã¢¹®´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(0),¿µÀº);
		if ( ¿µÀº°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}
		if ( ¿µÀºÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ < 0 ) {
			Áö¿ì°³ÅÐ±â();
		}
		
		
		
		String Á¤È¯ = null;
		int Á¤È¯°É·¹±ú²ýÇÔ = 5;
		int Á¤È¯ÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ = 5;
		Ä¥ÆÇ´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(1),Á¤È¯);
		Ã¢¹®´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(0),Á¤È¯);
		if ( Á¤È¯°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}
		if ( Á¤È¯ÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ < 0 ) {
			Áö¿ì°³ÅÐ±â();
		}
		
		
		
		
		String ½Â¿± = null;
		int ½Â¿±°É·¹±ú²ýÇÔ = 5;
		int ½Â¿±ÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ = 5;
		Ä¥ÆÇ´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(2),½Â¿±);
		Ã¢¹®´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(0),½Â¿±);
		if ( ½Â¿±°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}
		if ( ½Â¿±ÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ < 0 ) {
			Áö¿ì°³ÅÐ±â();
		}
		
		
		
		String ¿µÀç = null;
		int ¿µÀç°É·¹±ú²ýÇÔ = 5;
		int ¿µÀçÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ = 5;
		Ä¥ÆÇ´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(3),¿µÀç);
		Ã¢¹®´Û±â(È¸ÀÇ½Ç¸®½ºÆ®.get(0),¿µÀç);
		if ( ¿µÀç°É·¹±ú²ýÇÔ < 0 ) {
			°É·¹»¡±â();
		}
		if ( ¿µÀçÀÇÄ¥ÆÇÁö¿ì°³±ú²ýÇÔ < 0 ) {
			Áö¿ì°³ÅÐ±â();
		}
		
		
		Ã»¼Ò³¡();
		
		

	}
	
	public static void ¹Ù´ÚÃ»¼ÒÇÏ±â(String ¸îÈ£¿¡,String ´©°¡,int ¿Î½º) {
		
	}

	public static void Ä¥ÆÇ´Û±â(String ¸îÈ£¿¡,String ´©°¡) {
		
	}
	
	public static void Áö¿ì°³ÅÐ±â() {
		
	}
	
	public static void °É·¹»¡±â() {
		
	}
	
	public static void Ã¢¹®´Û±â(String ¸îÈ£¿¡,String ´©°¡) {
		
	}
	
	public static void ¿Î½º¸®ÇÊ(int ¿Î½º) {
		
	}
	
	public static void Ã»¼Ò³¡() {
		System.out.println("Ã»¼Ò³¡ÀÌ´Ù~~~~~~~~~~~~");
	}

}
